# FloorMightLookWrong Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..MassFailures..::..FloorMightLookWrong Property
BuiltInFailures..::..MassFailures Class See Also
---
Mass Floors may appear incorrect since the Mass contains mesh and solid geometry.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId FloorMightLookWrong { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property FloorMightLookWrong As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ FloorMightLookWrong {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..MassFailures Class
Autodesk.Revit.DB Namespace